Revit 2026 API

# AlphanumericRevisionSettingsIsValid Method

---

Determines whether the AlphanumericRevisionSettings object is in a valid state.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid()
```
```vb
Public Function IsValid As Boolean
```
```cpp
public:
bool IsValid()
```
```fsharp
member IsValid : unit -> bool
```

#### Return Value

Boolean True if the settings are valid.

The AlphanumericRevisionSettings should have at least one string in its revision numbering sequence.

#### Reference

AlphanumericRevisionSettings Class

Autodesk.Revit.DB Namespace